

# Python算术运算符：
#    +  -  *  /    %余数  //（整除:向下取整）   **次方
print(10 + 4)  # 14
print(10 - 4)  # 6
print(10 * 4)  # 40
print(10 / 4)  # 2.5
print(10 % 4)  # 2
print(10 // 4)  # 2
print(10 ** 4)  # 10000

# print(-10 / 4)  # -2.5
# print(-10 // 4)  # -3  向下取整:比我小的最大整数

# 科学计数法
a = 3.14 * 10**5
b = 3.14e5
print(a, b)


# 常见内存单位：
# 1bit = 0 或 1
# 1Byte = 8bit
# 1KB = 1024Byte
# 1MB = 1024KB
# 1GB = 1024MB
# 1TB = 1024GB
# 1PB = 1024TB
# 1EB = 1024PB
# ...


# 练习：从控制台输入一个三位数，取出个位，十位，百位
n = int(input('输入一个三位数：'))
# n = 123
a = n // 100  # 百位
b = n // 10 % 10  # 十位
c = n % 10  # 个位
print(a, b, c)
